import Image from "next/image";

export default function About() {
  return (
    <div className="w-full pb-[50px]">
      <div className="flex h-[240px] w-full items-center justify-center bg-[#011C65] text-[48px] text-white">
        Бидний тухай
      </div>
      <div className="flex flex-col px-[5%] py-[50px] lg:flex-row">
        <div className="w-[90%] text-[32px] font-bold lg:w-[40%]">
          Уран ган экспо нь
        </div>
        <div className="text-justify text-[16px] lg:w-[60%]">
          Өнөөдрийн байдлаар автомашины худалдаа, авто сэлбэгийн худалдаа,
          агрегат засвар үйлчилгээ, авто угаалгын газар, барилгын материалын
          төрөлжсөн худалдаа нэг дор үйл ажиллагаагаа эрхлэн явуулж байна. Мөн
          тус төв нь авто тээврийн үндэсний төв, банк санхүү, нотариат, оффис,
          зочид буудал, биллиард, цайны газар зэрэг үйлчилгээг нийтэд нь
          цогцлоосон. Цаашид манай төсөл нь хэрэглэгч үйлчлүүлэгчдийнхээ хүсэлт
          шаардлагад нийцсэн нийт 20,000м2 талбайд үйл ажиллагаагаа
          өргөжүүлэхээр зорилт тавин ажиллаж байна. Уг худалдааны төвд 500 гаруй
          ажлын байр Улаанбаатар хотод шинээр бий болгож нийт ажилчид худалдаа
          эрхлэгчдийн өрхийн амьжиргааг дэмжиж байна. Мөн нийт үйлчлүүлэгчдэд
          зориулсан авто машины хүрэлцээт зогсоол талбайтайгаас гадна хоёр
          давхар авто зогсоол шинээр байгуулж байна.
        </div>
      </div>
      <div className="">
        <Image
          src="/about/driveway.png"
          alt="driveway"
          width={1300}
          height={630}
          className="h-auto w-full rounded-[12px] px-[5%]"
        />
      </div>
    </div>
  );
}
